Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/evidence/dna_evidence.html.txt.tmx
Source language: en
Languages: ga

source: DNA stands for "deoxyribunucleic acid" and it is the blueprint for your genetic makeup
ga: DNA, sin "aigéad dí-ocsairibeanúicléasach " atá ina lorg don chomhdhéanamh géiniteach

source: DNA is composed of a pattern of bands (a little like a bar code) and the arrangement of the bands is unique to every person
ga: Tá DNA déanta suas as patrún bandaí (beagainín cosúil le barrachód) agus tá socrú na mbandaí seo éagsúil i ngach duine

source: There are some common features between the pattern of bands of parents, their children and other relatives
ga: Tá tréithe coitianta faoi leith i bpatrúin na mbandaí atá ag tuismitheoirí agus ag a gcuid leanaí

source: DNA testing can be done on a tiny sample of blood, semen or any body tissue
ga: Ní theastaíonn ach sampla beag bídeach fola, síol nó aon fhiochán coirp eile le tastáil DNA a dhéanamh air

source: When a DNA test is done, a "profile" of the DNA is taken
ga: Nuair a dhéantar tástáil DNA tógtar "próifíl" den DNA

source: DNA testing can be very useful evidence, for example:
ga: Bíonn tástáil DNA fíor thábhachtach mar fhianaise i ndá chás:

source: • DNA can be used to establish paternity
ga: • Is féidir DNA a úsáid le atharthacht a chruthú

source: If your DNA is compared to another person's, it can be established whether you are the parent of that person
ga: Má chuirtear do chuid DNA i gcomparáid le DNA duine eile is féidir a chruthú an tú tuismitheoir an duine sin

source: • DNA can also be used to prove identity
ga: • Is féidir DNA a úsáid le aitheantas duine a chruthú

source: For example, if a sample of blood is found at the scene of the crime, a DNA test can be performed on that blood to work out the DNA "profile"
ga: Mar shampla, má bhíonn sampla fola tógtha ag láthair coire, is féidir tástáil DNA a dhéanamh ar an bhfuil sin le "próifíl" DNA a chruthú

source: That DNA "profile" can then be compared to a suspect's DNA sample
ga: Is féidir ansin an "próifíl" sin a chur i gcomparáid le sampla DNA ó dhuine atá in amhras coire

source: That way, it can be established whether the blood found at the scene of the crime is the suspect's blood
ga: Mar sin, is féidir a chruthú an í fuil an té atá in amhras í an fhuil a fuarthas ag láthair coire

source: The Criminal Justice Act 2006 provides that mouth swabs and hair samples will no longer be considered as "intimate samples" , this means that your consent is not required for taking them
ga: Leagann an tAcht um Cheartas Coiriúil 2006 síos nach féidir a dhearbhú níos mó gur "samplaí príobháideacha" iad maipíní béil nó samplaí gruaige. Mar sin ní gá do chead a iarraidh iad a thógáil

source: When DNA evidence is introduced in court, it is always explained by an expert witness
ga: Nuair a bhíonn fianaise DNA tarraingte anuas sa chúirt is finné saineolaí a dhéanann í a mhíniú i gcónaí

source: The expert will tell the court how often that "profile" is found in the general population
ga: Inseoidh an saineolaí don chúirt cé chomh minic a fhaightear an "próifíl" sin sa daonra ginearálta

source: For example, the expert may tell the court that this "profile" is found in approximately 1 person in every 1,000,000 people
ga: Mar shampla, d'fhéadfadh sé go n-inseodh an saineolaí don chúirt go bhfuil an "próifíl" seo le fáil i dtuairim duine i ngach 1,000,000 daoine

source: Criminal Law and Procedure: Establishment of a DNA Database
ga: Dlí Coiriúil agus Nós Imeachta: Bunachar Sonraí DNA a bhunú

source: The Law Reform Commission of Ireland published a Consultation Paper on the Establishment of a DNA Database in March 2004
ga: D’fhoilsigh an Coimisiún um Athchóiriú an Dlí páipéar comhairliúcháin faoi bhunachar sonraí DNA a bhunú i Márta 2004

source: The publication of this Consultation Paper followed a request in 2003 by the Ireland's Attorney General to consider the issue
ga: Lean foilseachán an pháipéir chomhairliúcháin seo iarratas ó Ard-Aighne na hÉireann i 2003 go ndéanfar an cheist seo a mheas

source: Recommendations made by the Commission examined the broad and complex constitutional and human rights issues that may arise; and secondly, the more specific question of what classes of DNA profiles would make up any database
ga: De bharr moltaí a tháinig ón choimisiún, rinneadh mionscrúdú ar cheisteanna leathana agus casta a bhaineann le cearta bunreachtúla agus cearta daonna a d’fhéadfadh a theacht aníos; agus ar an dara dul síos, an tsaincheist sin faoi céard iad na ranganna próifíle DNA a n-úsáidfí chun bunachar sonraí ar bith a chur le chéile

source: The Law Reform Commission Paper drew clear distinctions between DNA samples and DNA profiles in making its recommendations, concluding that profiles only would be retained on the database
ga: Leag Páipéar an Choimisiúin um Athchóiriú An Dlí amach idirdhealuithe soiléire idir na moltaí a rinneadh idir samplaí DNA agus próifílí DNA, ag beartú go mbeadh próifílí amháin á gcoinneáil sa bhunachar sonraí

source: The Commission made a provisional recommendation on the establishment of a limited DNA Database, in which profiles of those reasonably suspected of, and convicted of, serious crimes would be retained on the database
ga: Rinne an coimisiún moladh sealadach faoi bhunachar sonraí DNA teoranta a bhunú, ina mbeadh próifílí díobh siúd a bhfuil amhras réasúnta fúthu go ndearna siad coireanna tromchúiseacha, agus iad siúd a ciontaíodh, á gcoinneáil ar an mbunachar sonraí

source: The Consultation Paper also addressed the issue of who should regulate and maintain the DNA Database, recommending that an independent State Forensic Agency be established for this purpose
ga: Dhírigh an Páipéar Comhairliúcháin ar an gceist faoi cé ar chóir dóibh bunachar sonraí DNA a rialú agus a chothabháil, ag moladh gur chóir Gníomhaireacht Stáit Fhóiréinseach neamhspleách a bhunú chuige seo

source: The Law Reform Commission published their final Report on the Establishment of a DNA Database (pdf) in November, 2005
ga: Tá rún ag an gCoimisiún um Athchóiriú an Dlí tuairisc ar an ábhar seo a fhoilsiú ag deireadh 2005 (pdf)

source: In June 2014 the Oireachtas passed the Criminal Justice (Forensic Evidence and DNA Database System) Act 2014 (pdf)
ga: I mí Meitheamh 2014 rith an tOireachtas an tAcht um Cheartas Coiriúil (Fianaise Dlí-Eolaíochta agus Córas Bunachair DNA) 2014 (pdf)

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
